export const postsData = [
  {
    id: 1,
    author: 'Максим Вікторович',
    avatar: 'https://i.pravatar.cc/150?u=a042581f4e29026024d',
    content: 'Сьогодні ми вивчаємо основи React та створюємо наш перший список компонентів з допомогою методу map()!',
    date: '24 березня 2026',
    likes: 42
  },
  {
    id: 2,
    author: 'Олена Петрівна',
    avatar: 'https://i.pravatar.cc/150?u=a042581f4e29026704d',
    content: 'CSS Modules - це насправді дуже зручний інструмент для ізоляції стилів. Забула про глобальні конфлікти класів назавжди.',
    date: '23 березня 2026',
    likes: 128
  },
  {
    id: 3,
    author: 'Іван Франко',
    avatar: 'https://i.pravatar.cc/150?u=a04258114e29026702d',
    content: 'Не забувайте завжди використовувати атрибут key при рендерингу списків. Це допоможе уникнути проблем зі сприйняттям React змін у DOM.',
    date: '22 березня 2026',
    likes: 85
  }
];
